Revit 2024 API
ScheduleFieldId Constructor
Initializes a new instance of the ScheduleFieldId class
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public ScheduleFieldId(
	int id
)
Visual Basic
Public Sub New ( _
	id As Integer _
)
Visual C++
public:
ScheduleFieldId(
	int id
)
Parameters
id
Type: System.Int32
See Also
ScheduleFieldId Class
Autodesk.Revit.DB Namespace